<?php
/**
 * 请在下面放置任何您需要的应用配置
 *
 * @license     http://www.phalapi.net/license GPL 协议
 * @link        http://www.phalapi.net/
 * @author dogstar <chanzonghuang@gmail.com> 2017-07-13
 */

return [
    'session_expire_time' => 600,   //在线状态维持,存在redis中,每当失效时,去db中拉取,可以用来标记用户当前是否在线
    'common_salt' => '*#&FD)#foo', // 公共盐值，设定后不可修改，否则会导致用户的密码失效

    /**
     * 第三方登录场景，用在登陆场景传入
     */
    'loginScene' => [
        1 => '微信h5',
        2 => '微信小程序',
    ],
    /**
     * 登录时选择的表
     */
    'loginSceneGroup' => [
        1 => 'wx_id',
        2 => 'wx_id',
    ],
    /**
     * 性取向
     */
    'sexuality' => [
        'Heterosexuality(异性恋)' => '4',
        'Gynosexuality(喜欢偏女性气质的同性对象)' => '1',
        'Androsexuality(喜欢偏雄性气质的同性对象)' => '2',
        'Ambisexuality(喜欢中性风格、美少年)' => '3',
        'Skoliosexual(喜欢非顺性别、伪娘)' => '5',
    ],
    'city' => [//豁免的市，当为这些市时显示市级别，否则显示省
        '深圳市',
        '广州市',
        '佛山市',
        '东莞市',
        '中山市',
        '珠海市',
        '厦门市',
        '福州市',
        '南昌市',
        '长沙市',
        '桂林市',
        '南宁市',
        '成都市',
        '贵阳市',
        '昆明市',
        '拉萨市',
        '乌鲁木齐市',
        '西宁市',
        '兰州市',
        '银川市',
        '合肥市',
        '郑州市',
        '太原市',
        '石家庄市',
        '呼和浩特市',
        '哈尔滨市',
        '长春市',
        '杭州市',
        '苏州市',
        '南京市',
        '西安市',
        '武汉市',
        '青岛市',
        '大连市',
        '沈阳市',
        '海口市',
        '三亚市',
    ],
];
